[{"filename": "Período I.pdf", "title": "Período I.pdf", "summary": "\nStar Wars begins with \"The Phantom Menace\" (Episode I), which takes place during a time of great tension in the galaxy. The Galactic Republic, a vast union of planets, is expanding but facing internal challenges, including corruption in its central government. Meanwhile, the Sith, a Force-using order, threaten the Republic, and Darth Sidious infiltrates the government as Chancellor Palpatine, manipulating events to weaken the Republic and increase his own power. Anakin Skywalker, a young slave with extraordinary Force abilities, is identified as the \"Chosen One\" who will bring balance to the Force. However, the Republic is on the brink of collapse due to disputes, the rise of the Separatists, and the threat of a galactic war. This leads to the formation of the Grand Army of the Republic and the outbreak of the Clone Wars. Anakin falls in love with Padmé Amidala, a senator and former queen of Naboo, which leads to his transformation into Darth Vader.", "file_size": 32317, "file_type": "application/pdf", "path": "C:\\Users\\joaov\\AppData\\Local\\Temp\\tmp30ytq3dd"}, {"filename": "Período II.pdf", "title": "Período II.pdf", "summary": " O Período II da saga Star Wars testemunha a ascensão do Império Galáctico e a queda da República. Darth Sidious orquestra a execução da Ordem 66, que resulta na eliminação da maioria dos Jedi. Anakin Skywalker se torna Darth Vader, o executor do Império. Obi-Wan Kenobi e Yoda são os poucos Jedi sobreviventes que buscam resistir ao Império. Luke e Leia, os filhos gêmeos de Anakin e Padmé, são separados para protegê-los do olhar atento de Vader e Sidious. Esta é uma época de perseguição aos Jedi e de opressão galáctica sob o domínio do Império.", "file_size": 31762, "file_type": "application/pdf", "path": "C:\\Users\\joaov\\AppData\\Local\\Temp\\tmp7ufd7a6v"}, {"filename": "Período III.pdf", "title": "Período III.pdf", "summary": " Após a destruição da segunda Estrela da Morte e a morte do Imperador Palpatine, a Aliança Rebelde vence e a Nova República é estabelecida. No entanto, os remanescentes imperiais se reúnem sob a Primeira Ordem, criando um cenário de conflitos e batalhas esporádicas. Os heróis originais lutam para construir um futuro melhor, enquanto novos personagens, como Rey, Finn e Poe Dameron, assumem a luta contra a Primeira Ordem. Rey, uma jovem sensível à Força, é treinada por Leia Organa e começa a descobrir sua verdadeira identidade e potencial, assumindo o manto da nova esperança da galáxia.", "file_size": 30084, "file_type": "application/pdf", "path": "C:\\Users\\joaov\\AppData\\Local\\Temp\\tmpwqrha_rv"}, {"filename": "Período IV.pdf", "title": "Período IV.pdf", "summary": " Os eventos dos Episódios VII, VIII e IX da saga Star Wars exploram a luta entre a Primeira Ordem, liderada por Snoke e Hux, e a Resistência, liderada por Leia Organa e Poe Dameron. Rey, Finn e Poe se unem para lutar contra a Primeira Ordem e Kylo Ren, filho de Leia e Han Solo, surge como um dos principais vilões. A batalha culmina com a derrota de Palpatine, o retorno de Ben Solo à luz e a restauração da paz na galáxia.", "file_size": 31609, "file_type": "application/pdf", "path": "C:\\Users\\joaov\\AppData\\Local\\Temp\\tmppygqw3lb"}, {"filename": "Senhor dos aneis.pdf", "title": "Senhor dos aneis.pdf", "summary": "\n\nO Senhor dos Anéis conta a história de um grupo de personagens que embarcam em uma jornada épica para destruir o Um Anel, criado pelo Senhor das Trevas Sauron, e salvar a Terra-média. A saga de Tolkien explora temas universais de amizade, esperança e o poder da vontade humana contra as trevas, e continua a encantar gerações de leitores e fãs de cinema.", "file_size": 30503, "file_type": "application/pdf", "path": "C:\\Users\\joaov\\AppData\\Local\\Temp\\tmpjbs3ft1j"}]